pulp-bio/wulpus-pro/fw/esp32/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"

CONFIG_BSP_LED_PIN=48

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y

CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=24
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=85
CONFIG_ESP32_WIFI_STATIC_TX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_RX_BA_WIN=32

CONFIG_LWIP_UDP_RECVMBOX_SIZE=16